from urllib.request import urlopen
import pandas as pd
from datetime import datetime
#Завантажуємо всі файли за індексом, створюємо ім'я з датою і часом створення
for i in range(1,29):
    #Використовуємо форматування рядків щоб вставити значення і в рядок
    url='https://www.star.nesdis.noaa.gov/smcd/emb/vci/VH/get_TS_admin.php?country=UKR&provinceID={}&year1=1981&year2=2020&type=Mean'.format(i) 
    vhi_url = urlopen(url)#Читаємо посилання
    now = datetime.now()#Дізнаємося який зараз момент часу
    date_and_time_time = now.strftime("%d%m%Y%H%M%S")#Вказуємо, які дані про час вивести і переводимо в рядок
    out = open(str(i)+'_'+date_and_time_time+'.csv','wb')#Створюємо файл, назва якого містить ID регіону і момент часу
    out.write(vhi_url.read())#Записуємо дані з сайту в файл
    print(out)
    out.close()#Закриваємо файл
    df = pd.read_csv(f'{i}_26102023171215.csv',index_col=False, header=1)
print(list(df.columns.values))
print(df[:1])
#Вибираємо записи для поточної області, за 2000-й рік та 18-й тиждень
df[(df['year']==2000) & (df['week']==18)]
#Читаємо один з отриманих файлів
df01 = pd.read_csv('1_26102023224131.csv', index_col=False, header=1)
df1 = df01.dropna()
#Створюємо таблицю з областями, які мають такі індекси як на сторінці
data = ["Черкаська", "Чернігівська", "Чернівецька", "Крим", "Дніпропетровська", "Донецька", "Івано-Франківська", "Харківська", "Херсонська", "Хмельницька", "Київська", "Київ", "Кіровоградська", "Луганська", "Львівська", "Миколаївска", "Одеська", "Полтавська", "Рівеньска", "Севастополь", "Сумська", "Тернопільска", "Закарпатьська", "Вінницька", "Волинська", "Запорізька", "Житомирська"]
df_old = pd.DataFrame(data, columns=['Області'])
print(df_old)
#Замінюємо зміст комірок на нові значення
df_old.loc[0, 'Області']='Вінницька'
df_old.loc[1, 'Області']='Волинська'
df_old.loc[2, 'Області']='Дніпропетровська'
df_old.loc[3, 'Області']='Донецька'
df_old.loc[4, 'Області']='Житомирська'
df_old.loc[5, 'Області']='Закарпатська'
df_old.loc[6, 'Області']='Запорізька'
df_old.loc[7, 'Області']='Івано-Франківська'
df_old.loc[8, 'Області']='Київська'
df_old.loc[9, 'Області']='Кіровоградська'
df_old.loc[10, 'Області']='Луганська'
df_old.loc[11, 'Області']='Львівська'
df_old.loc[12, 'Області']='Миколаївська'
df_old.loc[13, 'Області']='Одеська'
df_old.loc[14, 'Області']='Полтавська'
df_old.loc[15, 'Області']='Рівенська'
df_old.loc[16, 'Області']='Сумська'
df_old.loc[17, 'Області']='Тернопільська'
df_old.loc[18, 'Області']='Харківська'
df_old.loc[19, 'Області']='Херсонська'
df_old.loc[20, 'Області']='Хмельницька'
df_old.loc[21, 'Області']='Черкаська'
df_old.loc[22, 'Області']='Чернівецька'
df_old.loc[23, 'Області']='Чернігівська'
df_old.loc[24, 'Області']='Республіка Крим'
df_old.loc[25, 'Області']='Київ'
df_old.loc[26, 'Області']='Севастополь'
print(df_old)
#Виводимо значення з одного стовпчика за перший рік
print(df1['VCI'][0:52])
#Знаходимо максимум в стовпчику
max_df1 = (df1['VCI']).max()
print(max_df1)
#Знаходимо мінімум в стовпчику
min_df1 = (df1['VCI']).min()
print(min_df1)
#Виводемо значення з одного стовпчика за весь час
print(df1['VCI'])
#Спроба знайти значення для посух (не зчитується стовпчик VHI
df_drought = df1[(df1["VHI"] <= 15) & (df1["VHI"] != -1)]
print(df_drought)
